# Логічні оператори порівнюють між собою вирази

umber_1 = 10
number_2 = 11



# and
if 1 == 1 and 'hello' == 'hello':
    print('True1')
# Нам поверне тру для обох виразів. Оператор енд виконує умову якщо і з ліва і з права тру. Якщо хоча б з одного боку фолс, то умова не виконається
if True and True:
    print('True2')

# or
if 1 == 1 or 'hello' != 'hello':
    print('True3')
# Для ор хоча б один вираз має бути правдивим

# not
if (1 == 1):
    print('True4')

if not(1 == 1):
    print('True5')

if not (1 != 1):
    print('True6')
# Нот міняє значення на протилежне. Використовується для

my_war = 'hello'

if my_war:
    print(my_war)
# Тут мається на увазі скорочено, що якщо май вар є тру, то надрукуватим ай вар. Будь який не пустий список, саме булеве значення тру - будуть тру.
# Фолс знаячення 0, пуста стрінга, пустий сет, список тощо, булеве фолс
# Якщо мені прилетить змінна пустою, то в мене нічого не надрукується.

if not my_war:
    print('oh my god')
# А отак ми скажемо, що якщо НЕ тру (пуста), то тоді друкуй. В даному прикладі не надрукує