string_1 = 'hello'
number_2 = [1, 'qwerty']

# in
# not in

# in перевіряє приналежність значення до об'єкта

if 'h' in string_1:
    print('True')
# Завдяки цьому перевіряємо чи значення яке ми шукаємо знаходиться в конкретному обєкті.

if 1 in number_2:
    print('yes it is')

# Можна також знайти букву в слові кверті в списку:
# Ітеруючий обєкт - той який має послідовні елементи, до яких, наприклад можна звертатись по айді
# тож саме ці обєкти можна перевірити на приналежність. таким є стрінга.

# Цикл! Може ще будемо вчити бо тут якось мельком:
for lit in string_1:
    print(lit)

# тут вказуємо по індексу конкретний обєкт
for lit in number_2[1]:
    print(lit)

if 'w' in number_2[1]:
    print('yep')