# Словник - ключ до словника може включати список або ще один словник або none або ще щось.
# І ще є ненаписане правило - ключем до списку може бути тільки незмінний тип даних.
# Зазвичай стрінги це якась стрінга або номер

"""None"""
# Допустимо, у нас є масив даних і ми не знаємо що там буде. З часом ми будемо в нього щось записувати

my_dict = {'name': 'Alise', 'age': None} # Пустим ми неможемо залишити.
# В пам'яті нан нічого не займає. Просто виділиться комірка але вона буде пуста.
# В коді коли ми будемо якісь змінні оголошувати і тільки згодом туди щось класти ми оголошуємо як нан.
# Динамічно типізований (в змінну можемо запихнути згодом все що завгодно, не важливо чому вона зара дорівнює.
# В більшості інших мов нан - це нал. Наприклад в джейсоні, при переході на пітонівську мову його нал буде перетворюватись на нан



