# Конкатинація або об'єднання
# Як можна об'єднювати сторки

string_1 = 'gender - mail'
string_2 = 'name - John'

print(string_1, string_2) # виводить стрінги через пробіл
print(string_1 + string_2) # склеює (без пробілу)
print(string_1 + ' ' + string_2) # а ось так буде з пробілом

print('=' * 30) # = в нас вивело 30 разів. Це щоби візуально розділити в консолі інформацію і щоб 30 разів не друкувати =

# Але ми не можемо об'єндати стрінгу з інтеджером, наприклад. Для цього нам потрібно інтеджер перевести в стрінгу (див. data_transformation)
age = 25
# print(string_1 + age) # тут видає помилку
print(str(age) + string_1) # а тут ні, бо ми перетворили інт в стрінг

# конкатинація списків
list_1 = [1, 2]
list_2 = [3, 4]

print(list_1 + list_2) # видасть як один список. Воно так працює але з цією метою краще використовувати вбудовану функцію ліста - екстенд.
# Будемо розбирати усі доступні функції наших типів даних
# Ми не можемо склеяти ліст з діктом тощо. Лише однотипні дані




