# ПЕРЕТВОРЕННЯ ТИПІВ
#  З попереднього домашнього:
# Create a list with people's names, some names should be repeated in it. Turn a list of duplicate names into a list of unique names using sets
names_of_people = ['Ihor', 'Denys', 'Natalia', 'Viktoria', 'Denys', 'Olena', 'Ihor']
set_of_names = set(names_of_people)
list_of_names = list(set_of_names)
print(list_of_names)

# це правильно
# Можна було ще зробити наступним чином:
print(set(names_of_people)) # Але тут воно не перетворить, а тільки виведе сетом в цьому конкретному прінті
# Але в завданні було сказано перетворити в список. Тому перший варіант вірний

# Оголошення змінних за допомогою вбудованих функцій
name = 'Olha' # звичайний спосіб
name2 = str('Olha') # за допомогою вбудованої функції

# Їх використовують для перетворення даних
ade = int('30') # Навіть якщо ми її подали як стрінгу, це всерівно буде інт, бо саме це ми оголосили. Тобто, ми тут зі стрінги '30' зробили інтове значення 30
high = int(170.5) # При перетворенні флоату в інтеджер воно обрубує десяткове закінчення. В даному випадку буде 170
print(high)

# Тут ми претворюємо словник в стрінгу
my_dict = {'name': 'Alise', 'age': 24}
print(str(my_dict)) # Тут ми претворюємо словник в стрінгу

# Зараз ми хочемо список перетворити у словник. Але словник має мати ключ і значення. Тому щоби це зробити, нам потрібно кожну пару (ключ, значення) взяти ще окремо в душки
my_list = [['name', 'Alise'], ['age', 24]]
print(dict(my_list))

