
my_war = []
if bool(my_war) is not False:
    print('my_war is not empty') # тут потрібно вписати бул так як іс та іс нот порівнюють лище однакові типи даних. так як фолс - булевий, то і май вар треба перевести в булевий.
    # і тоді умова, що якщо не фолс, тобто не пусте, тобто якщо там щось є, то виведи це речення. В даному випадку не виведе

    # Логічні оператори порівнюють між собою вирази

    umber_1 = 10
    number_2 = 11

    # and
    if 1 == 1 and 'hello' == 'hello':
        print('True1')
    # Нам поверне тру для обох виразів. Оператор енд виконує умову якщо і з ліва і з права тру. Якщо хоча б з одного боку фолс, то умова не виконається
    if True and True:
        print('True2')

    # or
    if 1 == 1 or 'hello' != 'hello':
        print('True3')
    # Для ор хоча б один вираз має бути правдивим

    # not
    if (1 == 1):
        print('True4')

    if not (1 == 1):
        print('True5')

    if not (1 != 1):
        print('True6')
    # Нот міняє значення на протилежне. Використовується для

    my_war = 'hello'

    if my_war:
        print(my_war)
    # Тут мається на увазі скорочено, що якщо май вар є тру, то надрукуватим ай вар. Будь який не пустий список, саме булеве значення тру - будуть тру.
    # Фолс знаячення 0, пуста стрінга, пустий сет, список тощо, булеве фолс
    # Якщо мені прилетить змінна пустою, то в мене нічого не надрукується.

    if not my_war:
        print('oh my god')
    # А отак ми скажемо, що якщо НЕ тру (пуста), то тоді друкуй. В даному прикладі не надрукує

    number = 10

    # if elif else це оператори бренчування, тобто розгалуження коду. За допомогою цієї конструкції ми будемо оперувати виразами.
    # Наш вираз має бути тру або фолс

    if number < 10:
        print('number is lower than 10')
    elif number > 10:
        print('number is upper than 10')
    else:
        print('number is 10')
    # елс в нас завжди без умови. еліфів може бути велика кількість.
    # мінімальне - це іф, якщо розгалуження, то використовуємо елів

    number_1 = 10
    number_2 = 2

    if (number_1 * number_2) < 10:
        print('number is lower than 10')
    elif (number_1 + number_2) == 10:
        print('number is upper than 10')
    elif number_1 == 10:
        print('True')
    else:
        print('False')
    # тут ми взяли в душки щоби дія виконалась перша (як в математиці)
    # якщо умови в двох розгалуженнях - тру, то виконається лише перша умова.
    # Якщо потрібно щоб виконались усі, то все зробити іфом але це вже будуть окремі конструкції не повязані між собою

    if (number_1 * number_2) > 10:
        print('if true')
    elif (number_1 + number_2) == 10:
        print('number is upper than 10')
    elif number_1 == 10:
        print('True')
    else:
        print('False')

    # вбудова функція інпут. коли користувач в нього щось втайпає, воно присвоюється в змінну
    secret_number = 8
    your_number = input('Guess number! Enter your variant: ')  # Тут нам в консолі виведе цей текст і туди можна буде щось ввести. Інпут означає стрінгове значення.
    # Якщо користувач вводитиме щось інше окрім інтів - функція взагалі не відпрацює. Ми присвоюємо змінній те що ввели з консолі

    if int(your_number) < secret_number:
        print('This number should be bigger')
    elif int(your_number) > secret_number:
        print('This number should be less')
    elif int(your_number) == secret_number:
        print('Hurrey! You are right!')

    # Так як користувач буде вводити туди числа, то цю змінну ми перевели в інтову
