students_count = 15
general_rate = 99.5
group_name = 'QA Automation 22.08'

# варіанти формату стрінги:

# format (в душках приймає аргументи. Аргументи то наші змінні.)
print('{} {} {}'.format(students_count, general_rate, group_name)) # аким чином в душки записались значення в такому порядку в якому ми передали назви змінних
# порядок можна міняти
print('{2} {0} {1}'.format(students_count, general_rate, group_name))

print('{0:d} {1:f} {2:s}'.format(students_count, general_rate, group_name)) # специфікатори - коли ми явно кажемо яка стрінга сюди має лягти пецифікатор для цілого числа - д,
# для флоату - ф і для стрінги - с. їх всього три. якщо ми додали специфікатор що це ціле число, а потім ідемо в змінну і намагаємось її змінити на флоат - нам вибиває валідаційну помилку.
# Використовується для конкретного зазначення типу змінної. Можна вчасно зреагувати що в змінних прилетіло щось не те.
# є можливістю відсувати наступне значення на певну кількість символів:
print('{0:>20d} {1:f} {2:s}'.format(students_count, general_rate, group_name)) # відступ зліва на право 20 символів
print('{0:^20d} {1:f} {2:s}'.format(students_count, general_rate, group_name)) # тих самих 20, але значення по центру
print('{0:d} {1:.2f} {2:s}'.format(students_count, general_rate, group_name)) # кількість символів після крапки

# f-string
print(f'{students_count} {general_rate:.3f} {group_name}') # це одна стрінга і в фігурних душках ми передаємо змінні

# індекси
letters = 'abcdefg'
print(letters[3])

# зрізи (з якого індекса почати: яким індексом закінчити: (в зворотньому порядку індекси рахуються з -1, -2 і так далі) крок: (наприклад, кожен другий символ
# slise (start: end: step:)
print(letters[1:-2:2])
print(letters[::-1]) # тут ми вказали лише степ з відємним значенням і тим самим развернули абетку іншими боком
